; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	image6 - mode
	image5 - mode
	infrared4 - mode
	thermograph3 - mode
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph2)
	(supports instrument1 image6)
	(calibration_target instrument1 Star4)
	(supports instrument2 image5)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star5)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet7 thermograph2)
	(have_image Planet7 spectrograph1)
	(have_image Star8 infrared4)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 image6)
	(have_image Phenomenon10 infrared4)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon11 image5)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon12 image5)
	(have_image Phenomenon13 thermograph2)
	(have_image Phenomenon13 thermograph3)
))

)

; plan
1. (turn_to satellite1 star5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star5)
   goals met: 1 of 14
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 14
3. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 1 of 14
4. (turn_to satellite1 planet7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet7)
   goals met: 1 of 14
5. (take_image satellite1 planet7 instrument3 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 2 of 14
6. (take_image satellite1 planet7 instrument3 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 3 of 14
7. (turn_to satellite1 phenomenon12 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 14
8. (take_image satellite1 phenomenon12 instrument3 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 4 of 14
9. (take_image satellite1 phenomenon12 instrument3 image5)
   added: (have_image phenomenon12 image5)
   goals met: 5 of 14
10. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 14
11. (take_image satellite1 phenomenon11 instrument3 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 14
12. (take_image satellite1 phenomenon11 instrument3 image5)
   added: (have_image phenomenon11 image5)
   goals met: 7 of 14
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 14
14. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 7 of 14
15. (turn_to satellite0 phenomenon9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 14
16. (take_image satellite0 phenomenon9 instrument1 image6)
   added: (have_image phenomenon9 image6)
   goals met: 7 of 14
17. (take_image satellite0 phenomenon9 instrument1 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 8 of 14
18. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 14
19. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 8 of 14
20. (turn_to satellite0 groundstation2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 14
21. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 8 of 14
22. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 8 of 14
23. (take_image satellite0 phenomenon10 instrument2 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 9 of 14
24. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 9 of 14
25. (take_image satellite0 phenomenon13 instrument2 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 10 of 14
26. (take_image satellite0 phenomenon13 instrument2 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 11 of 14
27. (turn_to satellite0 star8 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star8)
   goals met: 11 of 14
28. (take_image satellite0 star8 instrument2 infrared4)
   added: (have_image star8 infrared4)
   goals met: 12 of 14
29. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 13 of 14
30. (turn_to satellite1 star8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star8)
   goals met: 13 of 14
31. (take_image satellite1 star8 instrument3 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 14 of 14
